app/Controllers/Article.php

SELECT *
FROM `article`
---
    public function admin_index()
    {
        $title = "Article Lists";
        $model = new ArticleModel();
        $article = $model->findAll();

SELECT COUNT(*) AS `numrows`
FROM `article`
WHERE `slug` = 'pola-makan-sehat'
INSERT INTO `article` (`title`, `content`, `slug`, `category`, `created_at`, `image`, `updated_at`) VALUES ('Pola Makan Sehat', 'Bantu tumbuh sehat dan aktif.', 'pola-makan-sehat', 'kesehatan', '2025-06-28 16:43:01', '1751128981_cc1d5844e1dfb88836e9.jpg', '2025-06-28 16:43:01')
---
    public function add()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            "title" => "required",
            "content" => "required",
            "category" => "required",
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $article = new ArticleModel();
            $title = $this->request->getPost("title");
            $slug = url_title($title, '-', true);
            $exists = $article->where("slug", $slug)->countAllResults();
            if ($exists > 0) {
                $slug .= '-' . time();
            }

            // Handle image upload
            $imageFile = $this->request->getFile('image');
            $imageName = null;
            if ($imageFile && $imageFile->isValid() && !$imageFile->hasMoved()) {
                $imageName = $imageFile->getRandomName();
                $imageFile->move(ROOTPATH . 'public/image', $imageName);
            }

            $article->insert([
                "title" => $title,
                "content" => $this->request->getPost("content"),
                "slug" => $slug,
                "category" => $this->request->getPost("category"),
                "created_at" => date("Y-m-d H:i:s"),
                "image" => $imageName,
            ]);

SELECT COUNT(*) AS `numrows`
FROM `article`
WHERE `slug` = 'jogging-pagi'
AND `id` != '22'
UPDATE `article` SET `title` = ' Jogging Pagi', `content` = 'menjaga kebugaran dan tingkatkan imun.', `slug` = 'jogging-pagi', `category` = 'olahraga', `updated_at` = '2025-06-28 16:45:11'
WHERE `article`.`id` IN ('22')
SELECT *
FROM `article`
WHERE `id` = '22'
 LIMIT 1
---
    public function edit($id)
    {
        $article = new ArticleModel();
        $validation = \Config\Services::validation();
        $validation->setRules([
            "title" => "required",
            "content" => "required",
            "category" => "required",
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $title = $this->request->getPost("title");
            $slug = url_title($title, '-', true);
            $exists = $article->where("slug", $slug)->where("id !=", $id)->countAllResults();
            if ($exists > 0) {
                $slug .= '-' . time();
            }

            $article->update($id, [
                "title" => $title,
                "content" => $this->request->getPost("content"),
                "slug" => $slug,
                "category" => $this->request->getPost("category"),
            ]);

            return redirect()->to("admin/article");
        }

        $data = $article->where("id", $id)->first();